"""Дано целое число N (32 < М < 126). Вывести символ с кодом, равным N."""

print(f"Числу соответствует символ: {chr(int(input('Введите целое число от 32 до 126: ')))}")
